<a href="https://colab.research.google.com/github/AlanGomes107/ETL_Extract_Transform_and_Load/blob/main/ETL02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

***EXTRAÇÃO DE DADOS***

In [ ]:
arquivo = open("sobrepython.txt", 'r', encoding='utf-8')
arquivo.readlines()

['Python é uma linguagem de programação de alto nível,[4] interpretada, de script, imperativa, orientada a objetos, funcional, de tipagem dinâmica e forte. Foi lançada por Guido van Rossum em 1991.[1] Atualmente possui um modelo de desenvolvimento comunitário, aberto e gerenciado pela organização sem fins lucrativos Python Software Foundation. Apesar de várias partes da linguagem possuírem padrões e especificações formais, a linguagem como um todo não é formalmente especificada. O padrão de facto é a implementação CPython.\n',
 '\n',
 'A linguagem foi projetada com a filosofia de enfatizar a importância do esforço do programador sobre o esforço computacional. Prioriza a legibilidade do código sobre a velocidade ou expressividade. Combina uma sintaxe concisa e clara com os recursos poderosos de sua biblioteca padrão e por módulos e frameworks desenvolvidos por terceiros.\n',
 '\n',
 'Python é uma linguagem de propósito geral de alto nível, multiparadigma, suporta o paradigma orientado a objetos, imperativo, funcional e procedural. Possui tipagem dinâmica e uma de suas principais características é permitir a fácil leitura do código e exigir poucas linhas de código se comparado ao mesmo programa em outras linguagens. Devido às suas características, ela é principalmente utilizada para processamento de textos, dados científicos e criação de CGIs para páginas dinâmicas para a web. Foi considerada pelo público a 3ª linguagem "mais amada", de acordo com uma pesquisa conduzida pelo site Stack Overflow em 2018,[5] e está entre as 5 linguagens mais populares, de acordo com uma pesquisa conduzida pela RedMonk.[6]\n',
 '\n',
 "O nome Python teve a sua origem no grupo humorístico britânico Monty Python,[7] criador do programa Monty Python's Flying Circus, embora muitas pessoas façam associação com o réptil do mesmo nome (em português, píton ou pitão).\n",
 '\n',
 'Fonte: https://pt.wikipedia.org/wiki/Python']

In [ ]:
arquivo.close()

***Não Pula linhas (mas mantém '\n' caso queira pular)***

In [ ]:
with open("sobrepython.txt", 'r', encoding='utf-8') as arquivo:
  print(arquivo.readlines())

['Python é uma linguagem de programação de alto nível,[4] interpretada, de script, imperativa, orientada a objetos, funcional, de tipagem dinâmica e forte. Foi lançada por Guido van Rossum em 1991.[1] Atualmente possui um modelo de desenvolvimento comunitário, aberto e gerenciado pela organização sem fins lucrativos Python Software Foundation. Apesar de várias partes da linguagem possuírem padrões e especificações formais, a linguagem como um todo não é formalmente especificada. O padrão de facto é a implementação CPython.\n', '\n', 'A linguagem foi projetada com a filosofia de enfatizar a importância do esforço do programador sobre o esforço computacional. Prioriza a legibilidade do código sobre a velocidade ou expressividade. Combina uma sintaxe concisa e clara com os recursos poderosos de sua biblioteca padrão e por módulos e frameworks desenvolvidos por terceiros.\n', '\n', 'Python é uma linguagem de propósito geral de alto nível, multiparadigma, suporta o paradigma orientado a objetos, imperativo, funcional e procedural. Possui tipagem dinâmica e uma de suas principais características é permitir a fácil leitura do código e exigir poucas linhas de código se comparado ao mesmo programa em outras linguagens. Devido às suas características, ela é principalmente utilizada para processamento de textos, dados científicos e criação de CGIs para páginas dinâmicas para a web. Foi considerada pelo público a 3ª linguagem "mais amada", de acordo com uma pesquisa conduzida pelo site Stack Overflow em 2018,[5] e está entre as 5 linguagens mais populares, de acordo com uma pesquisa conduzida pela RedMonk.[6]\n', '\n', "O nome Python teve a sua origem no grupo humorístico britânico Monty Python,[7] criador do programa Monty Python's Flying Circus, embora muitas pessoas façam associação com o réptil do mesmo nome (em português, píton ou pitão).\n", '\n', 'Fonte: https://pt.wikipedia.org/wiki/Python']

***splitlines (pula linhas evidenciada por ' ')***

In [ ]:
arquivo = open("sobrepython.txt", 'r', encoding='utf-8')
arquivo.readline().splitlines()

['Python é uma linguagem de programação de alto nível,[4] interpretada, de script, imperativa, orientada a objetos, funcional, de tipagem dinâmica e forte. Foi lançada por Guido van Rossum em 1991.[1] Atualmente possui um modelo de desenvolvimento comunitário, aberto e gerenciado pela organização sem fins lucrativos Python Software Foundation. Apesar de várias partes da linguagem possuírem padrões e especificações formais, a linguagem como um todo não é formalmente especificada. O padrão de facto é a implementação CPython.']

In [ ]:
arquivo.close()

In [ ]:
with open('sobrepython.txt', 'r', encoding='utf-8') as arquivo:
  print(arquivo.readline().splitlines())

['Python é uma linguagem de programação de alto nível,[4] interpretada, de script, imperativa, orientada a objetos, funcional, de tipagem dinâmica e forte. Foi lançada por Guido van Rossum em 1991.[1] Atualmente possui um modelo de desenvolvimento comunitário, aberto e gerenciado pela organização sem fins lucrativos Python Software Foundation. Apesar de várias partes da linguagem possuírem padrões e especificações formais, a linguagem como um todo não é formalmente especificada. O padrão de facto é a implementação CPython.']

***PANDAS***

In [ ]:
import pandas as pd
import numpy as np
notas = pd.Series([2,7,5,10,6])
print(notas)
print('Soma', notas.sum())
print('Média', notas.mean())
print('Contagem', notas.count())

0     2
1     7
2     5
3    10
4     6
dtype: int64
Soma 30
Média 6.0
Contagem 5

In [ ]:
serie = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=50)))
serie

0     e
1     c
2     a
3     d
4     h
5     c
6     e
7     d
8     g
9     h
10    g
11    h
12    c
13    f
14    b
15    a
16    g
17    e
18    a
19    h
20    h
21    d
22    a
23    b
24    c
25    g
26    e
27    a
28    a
29    f
30    e
31    a
32    b
33    g
34    d
35    c
36    h
37    d
38    d
39    c
40    g
41    e
42    c
43    d
44    c
45    b
46    e
47    g
48    g
49    b
dtype: object

Explicação do exemplo acima, caso seja necessário, basicamente os valores de "a" a "g" vão substituir os números de 0 a 7 (lembrando é 7 porque o python vai simular números de 0 a 7 sem incluir o 8)

In [ ]:
u=np.random.randint(8,size=50)
serie = pd.Series(np.take(list('abcdefgh'),u))
serie
serie2 = pd.DataFrame(serie,columns=['serie'])
u2 = pd.DataFrame(u,columns=['u'])
tab = pd.concat([serie2,u2],axis=1)
print(tab)

   serie  u
0      h  7
1      c  2
2      h  7
3      a  0
4      b  1
5      e  4
6      g  6
7      d  3
8      f  5
9      a  0
10     a  0
11     g  6
12     h  7
13     g  6
14     f  5
15     g  6
16     h  7
17     c  2
18     c  2
19     a  0
20     g  6
21     g  6
22     a  0
23     g  6
24     d  3
25     f  5
26     b  1
27     f  5
28     a  0
29     e  4
30     e  4
31     h  7
32     f  5
33     f  5
34     e  4
35     b  1
36     f  5
37     d  3
38     b  1
39     h  7
40     d  3
41     g  6
42     d  3
43     c  2
44     b  1
45     c  2
46     c  2
47     c  2
48     e  4
49     g  6

In [ ]:
a = [4,3,5,7,6,8]
indices = [0,1,4]
np.take(a, indices)

array([4, 3, 6])

**Como saber a frequência (quantidade de vezes em cada índice)?**

In [ ]:
serie = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=50)))
serie.value_counts()

g    9
a    9
b    8
e    8
f    7
d    4
c    3
h    2
dtype: int64

In [ ]:
s2 = pd.Series(np.random.randint(1,10,7))
print(s2)
np.where(s2 % 2==0)

0    5
1    9
2    6
3    3
4    3
5    3
6    5
dtype: int64

(array([2]),)

In [ ]:
palavras = pd.Series(['casa', ' azul', 'bola', 'brigadeiro'])
palavras

0          casa
1          azul
2          bola
3    brigadeiro
dtype: object

In [ ]:
palavras = pd.Series(['casa', ' azul', 'bola', 'brigadeiro'])
palavras.map(lambda x: x.title())

0          Casa
1          Azul
2          Bola
3    Brigadeiro
dtype: object

In [ ]:
palavras = pd.Series(['casa','azul','bola','brigadeiro'])
palavras.map(lambda x: x.upper())

0          CASA
1          AZUL
2          BOLA
3    BRIGADEIRO
dtype: object

***PANDAS DATA FRAME***

Criando um Data frame com 5 linhas

In [ ]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

Criando uma Data Frame com 5 colunas

In [ ]:
data1 = [1,2,3,4,5]
df = pd.DataFrame([data1], columns=list('abcde'))
print(df.shape) #Número de linhas e colunas (x,y) em que x é linhas e y colunas
df

(1, 5)

   a  b  c  d  e
0  1  2  3  4  5

Variação de como colocar nomes nas colunas

In [ ]:
data1 = [1,2,3,4,5] 
df = pd.DataFrame([data1],columns=['a','b','c','D','E'])
df

   a  b  c  D  E
0  1  2  3  4  5

In [ ]:
data1 = [1,2,3,4,5]
df = pd.DataFrame( data1, columns=list('a'))
print(df.shape) #Número de linhas e colunas (x,y) em que x é linhas e y colunas
df

(5, 1)

   a
0  1
1  2
2  3
3  4
4  5

In [ ]:
data1 = [1,2,3,4,5]
data2 = [5,7,8,9,10]
df = pd.DataFrame([data1,data2], columns=list('abcde'))
print(df.shape)
df

(2, 5)

   a  b  c  d   e
0  1  2  3  4   5
1  5  7  8  9  10

Criando um DataFrame a partir de um array

In [ ]:
dados = np.random.rand(5,2)
print(dados)
df = pd.DataFrame(dados)
df

[[0.58777935 0.14330787]
 [0.30484062 0.22364201]
 [0.14551678 0.03236545]
 [0.09425987 0.80395595]
 [0.08359465 0.72596117]]

          0         1
0  0.587779  0.143308
1  0.304841  0.223642
2  0.145517  0.032365
3  0.094260  0.803956
4  0.083595  0.725961

Criando um DataFrame a partir de um array (Números Inteiros, com teto de valor)

In [ ]:
dados = np.random.randint(20, size=(5,2))
df = pd.DataFrame(dados)
df

    0   1
0  17  14
1  12  13
2  19  16
3  13  18
4   7  16

In [ ]:
ser1 = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [ ]:
df = pd.concat([ser1, ser2], axis=1)
df

    0   1
0   a   0
1   b   1
2   c   2
3   d   3
4   e   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

In [ ]:
df = pd.DataFrame({'col1':pd.Series(data1), 'col2':pd.Series(data2)})
df

   col1  col2
0     1     5
1     2     7
2     3     8
3     4     9
4     5    10

In [ ]:
df = pd.DataFrame({
'Aluno':['Alfredo', 'Abel', 'Henrique', 'Julia', 'Calie'], 
'Falta':[3,4,2,1,4],
'Prova':[2,7,5,10,6],
'Apresentação':[8.5, 7.5, 9.0, 7.5, 8.0]})
df

      Aluno  Falta  Prova  Apresentação
0   Alfredo      3      2           8.5
1      Abel      4      7           7.5
2  Henrique      2      5           9.0
3     Julia      1     10           7.5
4     Calie      4      6           8.0

In [ ]:
print(df.columns)

Index(['Aluno', 'Falta', 'Prova', 'Apresentação'], dtype='object')

In [ ]:
print(df.dtypes)

Aluno            object
Falta             int64
Prova             int64
Apresentação    float64
dtype: object

In [ ]:
print(df['Apresentação'])

0    8.5
1    7.5
2    9.0
3    7.5
4    8.0
Name: Apresentação, dtype: float64

In [ ]:
print(df[['Apresentação']])

   Apresentação
0           8.5
1           7.5
2           9.0
3           7.5
4           8.0

In [ ]:
print(df.sum())

Aluno           AlfredoAbelHenriqueJuliaCalie
Falta                                      14
Prova                                      30
Apresentação                             40.5
dtype: object

In [ ]:
print(df)

      Aluno  Falta  Prova  Apresentação
0   Alfredo      3      2           8.5
1      Abel      4      7           7.5
2  Henrique      2      5           9.0
3     Julia      1     10           7.5
4     Calie      4      6           8.0

In [ ]:
print(df[['Apresentação','Falta']].sum())

Apresentação    40.5
Falta           14.0
dtype: float64

***PANDAS SERIES***

In [ ]:
df.sort_values('Apresentação')

      Aluno  Falta  Prova  Apresentação
1      Abel      4      7           7.5
3     Julia      1     10           7.5
4     Calie      4      6           8.0
0   Alfredo      3      2           8.5
2  Henrique      2      5           9.0

In [ ]:
df.sort_values('Apresentação', ascending=False)

      Aluno  Falta  Prova  Apresentação
2  Henrique      2      5           9.0
0   Alfredo      3      2           8.5
4     Calie      4      6           8.0
1      Abel      4      7           7.5
3     Julia      1     10           7.5

In [ ]:
df[df['Apresentação']> 8.0]

      Aluno  Falta  Prova  Apresentação
0   Alfredo      3      2           8.5
2  Henrique      2      5           9.0

In [ ]:
df[(df['Apresentação'] > 8.0) & (df['Falta'] > 2.0)] # and

     Aluno  Falta  Prova  Apresentação
0  Alfredo      3      2           8.5

In [ ]:
df[(df['Apresentação'] > 8.0) | (df['Falta'] > 2.0)] # or

      Aluno  Falta  Prova  Apresentação
0   Alfredo      3      2           8.5
1      Abel      4      7           7.5
2  Henrique      2      5           9.0
4     Calie      4      6           8.0

In [ ]:
data = {'nome':['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'idade': [42,52,68,24,73],
        'preTestScore': [4,24,31,2,3],
        'postTestScore': [25,94,57,62,70]}
df = pd.DataFrame(data)
df

    nome  idade  preTestScore  postTestScore
0  Jason     42             4             25
1  Molly     52            24             94
2   Tina     68            31             57
3   Jake     24             2             62
4    Amy     73             3             70

In [ ]:
df['idoso'] = np.where(df['idade'] >= 65, 'sim', 'não') # Criando uma nova coluna chamada idoso, 
# em que o valor é ‘sim’ e se a idade for maior que 65 e “não”, caso contrário.
df

    nome  idade  preTestScore  postTestScore idoso
0  Jason     42             4             25   não
1  Molly     52            24             94   não
2   Tina     68            31             57   sim
3   Jake     24             2             62   não
4    Amy     73             3             70   sim

***PANDAS - LEITURA DE DADOS***

***CSV***

In [ ]:
apple = pd.read_csv('AAPL.csv', sep=',') #Vamos ler o histório de 4 anos de preços das ações da Apple
print(apple)

            Date        Open        High  ...       Close   Adj Close     Volume
0     2016-03-01   97.650002  100.769997  ...  100.529999   94.228645   50407100
1     2016-03-02  100.510002  100.889999  ...  100.750000   94.434853   33169600
2     2016-03-03  100.580002  101.709999  ...  101.500000   95.137848   36955700
3     2016-03-04  102.370003  103.750000  ...  103.010002   96.553185   46055100
4     2016-03-07  102.389999  102.830002  ...  101.870003   95.484657   35828900
...          ...         ...         ...  ...         ...         ...        ...
1002  2020-02-24  297.260010  304.179993  ...  298.179993  298.179993   55548800
1003  2020-02-25  300.950012  302.529999  ...  288.079987  288.079987   57668400
1004  2020-02-26  286.529999  297.880005  ...  292.649994  292.649994   49513700
1005  2020-02-27  281.100006  286.000000  ...  273.519989  273.519989   80151400
1006  2020-02-28  257.260010  278.410004  ...  273.359985  273.359985  106627500

[1007 rows x 7 columns]

In [ ]:
print(apple.head()) # A função "head" exibe as 5 primeiras e ultimas linhas da tabela

         Date        Open        High  ...       Close  Adj Close    Volume
0  2016-03-01   97.650002  100.769997  ...  100.529999  94.228645  50407100
1  2016-03-02  100.510002  100.889999  ...  100.750000  94.434853  33169600
2  2016-03-03  100.580002  101.709999  ...  101.500000  95.137848  36955700
3  2016-03-04  102.370003  103.750000  ...  103.010002  96.553185  46055100
4  2016-03-07  102.389999  102.830002  ...  101.870003  95.484657  35828900

[5 rows x 7 columns]

In [ ]:
print(apple.tail()) # A função "tail" exibe as 5 ultimas linhas da tabela

            Date        Open        High  ...       Close   Adj Close     Volume
1002  2020-02-24  297.260010  304.179993  ...  298.179993  298.179993   55548800
1003  2020-02-25  300.950012  302.529999  ...  288.079987  288.079987   57668400
1004  2020-02-26  286.529999  297.880005  ...  292.649994  292.649994   49513700
1005  2020-02-27  281.100006  286.000000  ...  273.519989  273.519989   80151400
1006  2020-02-28  257.260010  278.410004  ...  273.359985  273.359985  106627500

[5 rows x 7 columns]

Os 10 dias com maiores valores de fechamento ajustado? A função "sort" ordena os dados

In [ ]:
apple.sort_values('Adj Close', ascending=False).head(10)

            Date        Open        High  ...       Close   Adj Close    Volume
995   2020-02-12  321.470001  327.220001  ...  327.200012  327.200012  28432600
997   2020-02-14  324.739990  325.980011  ...  324.950012  324.950012  20028400
996   2020-02-13  324.190002  326.220001  ...  324.869995  324.869995  23686900
991   2020-02-06  322.570007  325.220001  ...  325.209991  324.440002  26356400
999   2020-02-19  320.000000  324.570007  ...  323.619995  323.619995  23496000
985   2020-01-29  324.450012  327.850006  ...  324.339996  323.572052  54057300
986   2020-01-30  320.540009  324.089996  ...  323.869995  323.103180  31685800
993   2020-02-10  314.179993  321.549988  ...  321.549988  321.549988  27337200
990   2020-02-05  323.519989  324.760010  ...  321.450012  320.688934  29706700
1000  2020-02-20  322.630005  324.649994  ...  320.299988  320.299988  25141500

[10 rows x 7 columns]

Os 10 piores valores de fechamento ajustado

In [ ]:
sorted_apple = apple.sort_values('Adj Close', ascending=False)
print(sorted_apple.tail(10))

          Date       Open       High        Low      Close  Adj Close    Volume
81  2016-06-24  92.910004  94.660004  92.650002  93.400002  88.078583  75311400
46  2016-05-05  94.000000  94.070000  92.680000  93.239998  87.927696  35890500
42  2016-04-29  93.989998  94.720001  92.510002  93.739998  87.864235  68531500
43  2016-05-02  93.970001  94.080002  92.400002  93.639999  87.770515  48160100
48  2016-05-09  93.000000  93.769997  92.589996  92.790001  87.503319  32936400
47  2016-05-06  93.370003  93.449997  91.849998  92.720001  87.437325  43699900
50  2016-05-11  93.480003  93.570000  92.459999  92.510002  87.239273  28719100
82  2016-06-27  93.000000  93.050003  91.500000  92.040001  86.796043  45489600
52  2016-05-13  90.000000  91.669998  90.000000  90.519997  85.362656  44392800
51  2016-05-12  92.720001  92.779999  89.470001  90.339996  85.192909  76314700

In [ ]:
dados = pd.read_csv('Dominios_GovBR_basico.zip', sep=';', encoding='latin1')
print(dados.head())
print(dados)

                           dominio  ...   ticket
0                eletrobras.gov.br  ...     5023
1  premioconservacaoenergia.gov.br  ...  5379045
2                    procel.gov.br  ...   453438
3                   proinfa.gov.br  ...   784297
4                     reluz.gov.br  ...   453442

[5 rows x 9 columns]
                              dominio  ...   ticket
0                   eletrobras.gov.br  ...     5023
1     premioconservacaoenergia.gov.br  ...  5379045
2                       procel.gov.br  ...   453438
3                      proinfa.gov.br  ...   784297
4                        reluz.gov.br  ...   453442
...                               ...  ...      ...
1610                  cefetsvs.gov.br  ...  1033880
1611                   cefetbg.gov.br  ...  1038981
1612                      prr4.gov.br  ...    12880
1613               veracruz-rs.gov.br  ...   352374
1614              telebrasilia.gov.br  ...        0

[1615 rows x 9 columns]

In [ ]:
dados = pd.read_csv("Dominios_GovBR_basico.zip", compression='zip', sep=";",
encoding="latin1")
print(dados.head())

                           dominio  ...   ticket
0                eletrobras.gov.br  ...     5023
1  premioconservacaoenergia.gov.br  ...  5379045
2                    procel.gov.br  ...   453438
3                   proinfa.gov.br  ...   784297
4                     reluz.gov.br  ...   453442

[5 rows x 9 columns]

In [ ]:
dados.uf.value_counts()

DF    969
RJ    173
SP     76
PE     42
RS     40
MG     38
PR     30
CE     25
SC     23
BA     21
ES     20
AM     17
PA     17
RN     15
MA     14
GO     13
PB     13
MS     12
RO      8
SE      8
MT      7
AP      6
PI      6
TO      6
AC      6
AL      6
RR      4
Name: uf, dtype: int64

In [ ]:
dados.uf.value_counts()[:5]

DF    969
RJ    173
SP     76
PE     42
RS     40
Name: uf, dtype: int64

In [ ]:
dados[dados.dominio.str.contains('banco')]

                         dominio  ...   ticket
6            bancocentral.gov.br  ...   135008
64    caixamaisqueumbanco.gov.br  ...  8785977
250  bancodeoportunidades.gov.br  ...   196982
679          bancodaterra.gov.br  ...   371252
758      bancodeconteudos.gov.br  ...  6496733
984         banconordeste.gov.br  ...    83925
992       bancodonordeste.gov.br  ...   756331

[7 rows x 9 columns]

**EXCEL**

In [ ]:
acoes = pd.read_excel('acoes.xlsx')
print(acoes.head())

         Date        Open        High  ...       Close  Adj Close    Volume
0  2016-03-01   97.650002  100.769997  ...  100.529999  94.228645  50407100
1  2016-03-02  100.510002  100.889999  ...  100.750000  94.434853  33169600
2  2016-03-03  100.580002  101.709999  ...  101.500000  95.137848  36955700
3  2016-03-04  102.370003  103.750000  ...  103.010002  96.553185  46055100
4  2016-03-07  102.389999  102.830002  ...  101.870003  95.484657  35828900

[5 rows x 7 columns]

In [ ]:
acoes = pd.read_excel('acoes.xlsx', sheet_name='amazon')
print(acoes.head())

         Date        Open        High  ...       Close   Adj Close   Volume
0  2016-03-01  556.289978  579.250000  ...  579.039978  579.039978  5038500
1  2016-03-02  581.750000  585.000000  ...  580.210022  580.210022  4582200
2  2016-03-03  577.960022  579.869995  ...  577.489990  577.489990  2741300
3  2016-03-04  581.070007  581.400024  ...  575.140015  575.140015  3416500
4  2016-03-07  573.539978  573.630005  ...  562.799988  562.799988  4926900

[5 rows x 7 columns]

In [ ]:
xlsx = pd.ExcelFile('acoes.xlsx')
print(xlsx.sheet_names) #auxiliar na importações

['apple', 'amazon', 'google', 'tesla']

In [ ]:
apple = pd.read_excel(xlsx, 'apple')
amazon = pd.read_excel(xlsx, 'amazon')
google = pd.read_excel(xlsx, 'google')
tesla = pd.read_excel(xlsx, 'tesla')

In [ ]:
preco_abertura = pd.concat([apple.Open, amazon.Open, google.Open, tesla.Open], axis=1)
preco_abertura

            Open         Open         Open        Open
0      97.650002   556.289978   703.619995  194.250000
1     100.510002   581.750000   719.000000  183.729996
2     100.580002   577.960022   718.679993  188.279999
3     102.370003   581.070007   714.989990  198.000000
4     102.389999   573.539978   706.900024  197.679993
...          ...          ...          ...         ...
1002  297.260010  2003.180054  1426.109985  839.000000
1003  300.950012  2026.420044  1433.000000  849.000000
1004  286.529999  1970.280029  1396.140015  782.500000
1005  281.100006  1934.380005  1362.060059  730.000000
1006  257.260010  1814.630005  1277.500000  629.700012

[1007 rows x 4 columns]

In [ ]:
preco_abertura.columns = xlsx.sheet_names
preco_abertura.columns

Index(['apple', 'amazon', 'google', 'tesla'], dtype='object')

In [ ]:
print(preco_abertura)

            Open         Open         Open        Open
0      97.650002   556.289978   703.619995  194.250000
1     100.510002   581.750000   719.000000  183.729996
2     100.580002   577.960022   718.679993  188.279999
3     102.370003   581.070007   714.989990  198.000000
4     102.389999   573.539978   706.900024  197.679993
...          ...          ...          ...         ...
1002  297.260010  2003.180054  1426.109985  839.000000
1003  300.950012  2026.420044  1433.000000  849.000000
1004  286.529999  1970.280029  1396.140015  782.500000
1005  281.100006  1934.380005  1362.060059  730.000000
1006  257.260010  1814.630005  1277.500000  629.700012

[1007 rows x 4 columns]

In [ ]:
preco_abertura.index = apple.Date
preco_abertura.index

Index(['2016-03-01', '2016-03-02', '2016-03-03', '2016-03-04', '2016-03-07',
       '2016-03-08', '2016-03-09', '2016-03-10', '2016-03-11', '2016-03-14',
       ...
       '2020-02-14', '2020-02-18', '2020-02-19', '2020-02-20', '2020-02-21',
       '2020-02-24', '2020-02-25', '2020-02-26', '2020-02-27', '2020-02-28'],
      dtype='object', name='Date', length=1007)

In [ ]:
type(preco_abertura.index)

pandas.core.indexes.base.Index

***JSON***

In [ ]:
filmes = pd.read_json("https://raw.githubusercontent.com/prust/wikipedia-movie-data/master/movies.json")

In [ ]:
print(filmes.sample(10)) # Amostra com 10 dados

                             title  ...               genres
18683           The Neptune Factor  ...    [Science Fiction]
7347                 Captain Blood  ...  [Adventure, Action]
28041          Goodbye To All That  ...             [Comedy]
9294   The Hunchback of Notre Dame  ...              [Drama]
18057                         Che!  ...          [Biography]
1997        Little Lord Fauntleroy  ...      [Comedy, Drama]
24579               Monster's Ball  ...              [Drama]
22120             Monster in a Box  ...                   []
13901              Treasure Island  ...          [Adventure]
6572             Counsellor at Law  ...              [Drama]

[10 rows x 4 columns]

In [ ]:
filmes.shape #Dimensão da "tabela"

(28795, 4)

In [ ]:
filmes.year.value_counts()[:3]

1919    634
1925    572
1936    504
Name: year, dtype: int64

In [ ]:
filmes.columns # Nome das Variaveis

Index(['title', 'year', 'cast', 'genres'], dtype='object')

In [ ]:
filmes_num = filmes[filmes.title.str.contains('09')] # Filmes que contém 09 no título
filmes_num.shape

(1, 4)

In [ ]:
len(filmes_num)

1

***HTML***

In [ ]:
url = 'https://www.contextures.com/xlSampleData01.html'

In [ ]:
tabelas = pd.read_html(url)
print("Retorna uma lista de tabelas contidas no site")
print(tabelas[0])

Retorna uma lista de tabelas contidas no site
             0        1         2        3      4         5        6
0    OrderDate   Region       Rep     Item  Units  UnitCost    Total
1     1/6/2020     East     Jones   Pencil     95      1.99   189.05
2    1/23/2020  Central    Kivell   Binder     50     19.99   999.50
3     2/9/2020  Central   Jardine   Pencil     36      4.99   179.64
4    2/26/2020  Central      Gill      Pen     27     19.99   539.73
5    3/15/2020     West   Sorvino   Pencil     56      2.99   167.44
6     4/1/2020     East     Jones   Binder     60      4.99   299.40
7    4/18/2020  Central   Andrews   Pencil     75      1.99   149.25
8     5/5/2020  Central   Jardine   Pencil     90      4.99   449.10
9    5/22/2020     West  Thompson   Pencil     32      1.99    63.68
10    6/8/2020     East     Jones   Binder     60      8.99   539.40
11   6/25/2020  Central    Morgan   Pencil     90      4.99   449.10
12   7/12/2020     East    Howard   Binder     29      1.99    57.71
13   7/29/2020     East    Parent   Binder     81     19.99  1619.19
14   8/15/2020     East     Jones   Pencil     35      4.99   174.65
15    9/1/2020  Central     Smith     Desk      2    125.00   250.00
16   9/18/2020     East     Jones  Pen Set     16     15.99   255.84
17   10/5/2020  Central    Morgan   Binder     28      8.99   251.72
18  10/22/2020     East     Jones      Pen     64      8.99   575.36
19   11/8/2020     East    Parent      Pen     15     19.99   299.85
20  11/25/2020  Central    Kivell  Pen Set     96      4.99   479.04
21  12/12/2020  Central     Smith   Pencil     67      1.29    86.43
22  12/29/2020     East    Parent  Pen Set     74     15.99  1183.26
23   1/15/2021  Central      Gill   Binder     46      8.99   413.54
24    2/1/2021  Central     Smith   Binder     87     15.00  1305.00
25   2/18/2021     East     Jones   Binder      4      4.99    19.96
26    3/7/2021     West   Sorvino   Binder      7     19.99   139.93
27   3/24/2021  Central   Jardine  Pen Set     50      4.99   249.50
28   4/10/2021  Central   Andrews   Pencil     66      1.99   131.34
29   4/27/2021     East    Howard      Pen     96      4.99   479.04
30   5/14/2021  Central      Gill   Pencil     53      1.29    68.37
31   5/31/2021  Central      Gill   Binder     80      8.99   719.20
32   6/17/2021  Central    Kivell     Desk      5    125.00   625.00
33    7/4/2021     East     Jones  Pen Set     62      4.99   309.38
34   7/21/2021  Central    Morgan  Pen Set     55     12.49   686.95
35    8/7/2021  Central    Kivell  Pen Set     42     23.95  1005.90
36   8/24/2021     West   Sorvino     Desk      3    275.00   825.00
37   9/10/2021  Central      Gill   Pencil      7      1.29     9.03
38   9/27/2021     West   Sorvino      Pen     76      1.99   151.24
39  10/14/2021     West  Thompson   Binder     57     19.99  1139.43
40  10/31/2021  Central   Andrews   Pencil     14      1.29    18.06
41  11/17/2021  Central   Jardine   Binder     11      4.99    54.89
42   12/4/2021  Central   Jardine   Binder     94     19.99  1879.06
43  12/21/2021  Central   Andrews   Binder     28      4.99   139.72

In [ ]:
tabela = tabelas[0]

In [ ]:
tabela.columns = tabela.iloc[0, :]
tabela.columns

Index(['OrderDate', 'Region', 'Rep', 'Item', 'Units', 'UnitCost', 'Total'], dtype='object', name=0)

In [ ]:
tabela = tabela[1:]
print(tabela)

0    OrderDate   Region       Rep     Item Units UnitCost    Total
1     1/6/2020     East     Jones   Pencil    95     1.99   189.05
2    1/23/2020  Central    Kivell   Binder    50    19.99   999.50
3     2/9/2020  Central   Jardine   Pencil    36     4.99   179.64
4    2/26/2020  Central      Gill      Pen    27    19.99   539.73
5    3/15/2020     West   Sorvino   Pencil    56     2.99   167.44
6     4/1/2020     East     Jones   Binder    60     4.99   299.40
7    4/18/2020  Central   Andrews   Pencil    75     1.99   149.25
8     5/5/2020  Central   Jardine   Pencil    90     4.99   449.10
9    5/22/2020     West  Thompson   Pencil    32     1.99    63.68
10    6/8/2020     East     Jones   Binder    60     8.99   539.40
11   6/25/2020  Central    Morgan   Pencil    90     4.99   449.10
12   7/12/2020     East    Howard   Binder    29     1.99    57.71
13   7/29/2020     East    Parent   Binder    81    19.99  1619.19
14   8/15/2020     East     Jones   Pencil    35     4.99   174.65
15    9/1/2020  Central     Smith     Desk     2   125.00   250.00
16   9/18/2020     East     Jones  Pen Set    16    15.99   255.84
17   10/5/2020  Central    Morgan   Binder    28     8.99   251.72
18  10/22/2020     East     Jones      Pen    64     8.99   575.36
19   11/8/2020     East    Parent      Pen    15    19.99   299.85
20  11/25/2020  Central    Kivell  Pen Set    96     4.99   479.04
21  12/12/2020  Central     Smith   Pencil    67     1.29    86.43
22  12/29/2020     East    Parent  Pen Set    74    15.99  1183.26
23   1/15/2021  Central      Gill   Binder    46     8.99   413.54
24    2/1/2021  Central     Smith   Binder    87    15.00  1305.00
25   2/18/2021     East     Jones   Binder     4     4.99    19.96
26    3/7/2021     West   Sorvino   Binder     7    19.99   139.93
27   3/24/2021  Central   Jardine  Pen Set    50     4.99   249.50
28   4/10/2021  Central   Andrews   Pencil    66     1.99   131.34
29   4/27/2021     East    Howard      Pen    96     4.99   479.04
30   5/14/2021  Central      Gill   Pencil    53     1.29    68.37
31   5/31/2021  Central      Gill   Binder    80     8.99   719.20
32   6/17/2021  Central    Kivell     Desk     5   125.00   625.00
33    7/4/2021     East     Jones  Pen Set    62     4.99   309.38
34   7/21/2021  Central    Morgan  Pen Set    55    12.49   686.95
35    8/7/2021  Central    Kivell  Pen Set    42    23.95  1005.90
36   8/24/2021     West   Sorvino     Desk     3   275.00   825.00
37   9/10/2021  Central      Gill   Pencil     7     1.29     9.03
38   9/27/2021     West   Sorvino      Pen    76     1.99   151.24
39  10/14/2021     West  Thompson   Binder    57    19.99  1139.43
40  10/31/2021  Central   Andrews   Pencil    14     1.29    18.06
41  11/17/2021  Central   Jardine   Binder    11     4.99    54.89
42   12/4/2021  Central   Jardine   Binder    94    19.99  1879.06
43  12/21/2021  Central   Andrews   Binder    28     4.99   139.72

In [ ]:
tabela[(tabela.Item == 'Pencil') & (tabela.Region == 'East')]

0   OrderDate Region    Rep    Item Units UnitCost   Total
1    1/6/2020   East  Jones  Pencil    95     1.99  189.05
14  8/15/2020   East  Jones  Pencil    35     4.99  174.65

***Web Scraping***

In [51]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
import numpy as np

In [8]:
url = 'https://finance.yahoo.com/quote/AMZN/history?p=AMZN'
html = requests.get(url)
soup = BeautifulSoup(html.text, 'html5lib')
soup.find('a')
soup.find_all('a')
html_tabela = soup.find('table')
print(html_tabela)
tabela_amazon = pd.read_html(str(html_tabela))[0]
print(tabela_amazon)

[]

In [19]:
url = 'https://www.amazon.com.br/s?k=python&rh=p_n_conditiontype%3A13862762011%2Cp_n_free_shipping_eligible%3A19171733011&dc&__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91'
html = requests.get(url)
soup = BeautifulSoup(html.text, 'html5lib')
livros = []
for div in soup.find_all('div', attrs={'class': 's-include-content-margin'}):
  nome = div.find('span', attrs= {'class': 'a-text-normal'})
  preco = div.find('span', attrs= {'class': 'a-price'})
  autor = div.find('span', attrs={'class': 'a-row a-size-base a-color-secondary'})
  livros.append([nome.text, preco.text, autor.text])
pd.DataFrame(livros, columns=['Titulo', 'Preço', 'Autor'])

Empty DataFrame
Columns: [Titulo, Preço, Autor]
Index: []

In [61]:
url = 'https://www.amazon.com.br/s?k=python&rh=p_n_conditiontype%3A13862762011%2Cp_n_free_shipping_eligible%3A19171733011&dc&__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91'
html = requests.get(url)
soup = BeautifulSoup(html.text, 'html5lib')
livros = []
for div in soup.find_all('div', attrs={'class': 's-include-content-margin'}):
  nome = div.find('span', attrs= {'class': 'a-text-normal'})
  preco = div.find('span', attrs= {'class': 'a-offscreen'})
  autor = div.find('span', attrs={'class': 'a-size-base'})
  livros.append([nome.text, preco.text, autor.text])
livros =pd.DataFrame(livros, columns=['Titulo', 'Preço', 'Autor'])
print(livros.head(10))

                                              Titulo  ...             Autor
0  Introdução à Programação com Python: Algoritmo...  ...  Edição Português
1  Python Fluente: Programação Clara, Concisa e E...  ...  Edição Português
2  Python Para Análise de Dados: Tratamento de Da...  ...  Edição Português
3  Python e Mercado Financeiro: Programação Para ...  ...  Edição Português
4  Pense em Python: Pense Como um Cientista da Co...  ...  Edição Português
5                   Use a Cabeça! Python ― 2ª Edição  ...  Edição Português
6        Começando a programar em Python para leigos  ...              por
7  Web Scraping com Python: Coletando Mais Dados ...  ...  Edição Português
8  Problemas Clássicos de Ciência da Computação c...  ...  Edição Português
9  Data science do zero: primeiras regras com o P...  ...  Edição Português

[10 rows x 3 columns]

In [41]:
type(livros)

pandas.core.frame.DataFrame

In [62]:
print(livros)

                                               Titulo  ...             Autor
0   Introdução à Programação com Python: Algoritmo...  ...  Edição Português
1   Python Fluente: Programação Clara, Concisa e E...  ...  Edição Português
2   Python Para Análise de Dados: Tratamento de Da...  ...  Edição Português
3   Python e Mercado Financeiro: Programação Para ...  ...  Edição Português
4   Pense em Python: Pense Como um Cientista da Co...  ...  Edição Português
5                    Use a Cabeça! Python ― 2ª Edição  ...  Edição Português
6         Começando a programar em Python para leigos  ...              por
7   Web Scraping com Python: Coletando Mais Dados ...  ...  Edição Português
8   Problemas Clássicos de Ciência da Computação c...  ...  Edição Português
9   Data science do zero: primeiras regras com o P...  ...  Edição Português
10  Data Science Do Zero: Noções Fundamentais com ...  ...  Edição Português
11  Aprenda Python 3 do jeito certo: uma introduçã...  ...  Edição Português
12  Python Crash Course, 2nd Edition: A Hands-On, ...  ...     Edição Inglês
13  Mãos à obra: aprendizado de máquina com Scikit...  ...  Edição Português
14  Entendendo Algoritmos: Um Guia Ilustrado Para ...  ...  Edição Português
15  Mãos à Obra: Aprendizado de Máquina com Scikit...  ...  Edição Português
16  O Guia do Mochileiro Python: Melhores Práticas...  ...  Edição Português
17  Programação de Redes com Python: Guia Abrangen...  ...  Edição Português
18  Aprendendo Padrões de Projeto em Python: Tire ...  ...  Edição Português
19  Machine Learning – Guia de Referência Rápida: ...  ...  Edição Português
20               Análise de Dados com Python e Pandas  ...  Edição Português
21  Aprenda Django 3 com Exemplos: Crie Aplicações...  ...  Edição Português
22                                  The Greedy Python  ...     Edição Inglês
23  Automate the Boring Stuff with Python, 2nd Edi...  ...     Edição Inglês
24  Intro to Python for Computer Science and Data ...  ...     Edição Inglês
25             Matemática com Python: um Guia Prático  ...  Edição Português
26  Python Basics: A Practical Introduction to Pyt...  ...     Edição Inglês
27  Introdução à Computação Usando Python - um Foc...  ...  Edição Português
28  Python Levado a Sério: Conselhos de um Faixa-p...  ...  Edição Português
29  Beyond the Basic Stuff with Python: Best Pract...  ...     Edição Inglês
30  Practical Python Programming for IoT: Build ad...  ...     Edição Inglês
31  Projetos com Python e Arduino: Como Desenvolve...  ...  Edição Português
32                 Tênis Cage Python, Fila, Masculino  ...             1.062
33                                Python Para Pentest  ...  Edição Português
34                 Algoritmos E Lógica Da Programação  ...  Edição Português
35  Introdução à mineração de dados: Conceitos bás...  ...  Edição Português
36  Ensine Seus Filhos a Programar: Um Guia Amigáv...  ...  Edição Português
37  Data Science Projects with Python: A case stud...  ...     Edição Inglês
38  Projetos de Ciência de Dados com Python: Abord...  ...  Edição Português
39  Monty Python and the Holy Grail (Special Edition)  ...             4.096
40     Beginners Guide To Python Programming For Kids  ...     Edição Inglês
41               Python para Data Science para leigos  ...              por
42  Hands-On Machine Learning with Scikit-Learn, K...  ...     Edição Inglês
43  Análise de Tráfego em Redes TCP/IP: Utilize Tc...  ...  Edição Português
44        Começando a programar em Python para leigos  ...  Edição Português
45  Monty Python's Total Rubbish: Complete Collect...  ...              por
46  Financial Theory with Python: A Gentle Introdu...  ...     Edição Inglês
47  Python e Django: desenvolvimento web moderno e...  ...              por

[48 rows x 3 columns]

***Comando para salvar em excel***

In [ ]:
# Digite o nome do data frame, seguido de ponto "."
# e em seguida use a função "to_excel", dentro do argumento da função explicite o nome do arquivo xlsx
livros.to_excel("livros_amazon.xlsx", sheet_name='Sheet1')

***Comando para salvar csv***

*Digite o nome do data frame, seguido de ponto "." e em seguida use a função "to_csv", dentro do argumento da função explicite o nome do arquivo CSV*

In [ ]:
livros.to_csv("livros_amazon.csv", index=False)